---
kind: property
id: P:Autodesk.Revit.DB.DisciplineTypeId.Piping
source: html/10ca5bb5-7510-fc04-3fd6-134c19a5256d.htm
---
# Autodesk.Revit.DB.DisciplineTypeId.Piping Property

Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId Piping { get; }
```